# Analyze Wage Data with Python

- [View Solution Notebook](./solutions.html)
- [View Project Page](https://www.codecademy.com/projects/practice/analyze-wage-data-with-python)

## Task Group 1 - Import and Clean

### Task 1

Display the first five lines of `df_wages`.

In [39]:
import pandas as pd

df_wages = pd.read_csv('wages.csv')

# Preview the data

### Task 2

Rename the `Occupation title (click on the occupation title to view its profile)` column to `Occupation title`.

In [40]:

# Rename the column
df_wages = df_wages.rename(columns={'Occupation title (click on the occupation title to view its profile)': 'Occupation title'})

# Preview the data
df_wages.head(15)
# show output

,Index,Occupation title,Year,Employment,Average hourly wage,Industry average,Similar occupation average
0,0,Management Occupations - Top Executives - Chie...,2021,200480,$102.41,$59.31,$57.94
1,1,Management Occupations - Top Executives - Gene...,2021,2984920,$55.41,$59.31,$57.94
2,2,Management Occupations - Top Executives - Legi...,2021,44590,NaN,$59.31,$57.94
3,3,"Management Occupations - Advertising, Marketin...",2021,22520,$68.68,$59.31,$69.77
4,4,"Management Occupations - Advertising, Marketin...",2021,278690,$73.77,$59.31,$69.77
5,5,"Management Occupations - Advertising, Marketin...",2021,453800,$68.46,$59.31,$69.77
6,6,"Management Occupations - Advertising, Marketin...",2021,59850,$66.35,$59.31,$69.77
7,7,"Management Occupations - Advertising, Marketin...",2021,23190,$57.40,$59.31,$69.77
8,8,Management Occupations - Operations Specialtie...,2021,224620,$54.34,$59.31,$67.26
9,9,Management Occupations - Operations Specialtie...,2021,101230,$49.03,$59.31,$67.26
10,10,Management Occupations - Operations Specialtie...,2021,485190,$78.33,$59.31,$67.26
11,11,Management Occupations - Operations Specialtie...,2021,681070,$73.78,$59.31,$67.26
12,12,Management Occupations - Operations Specialtie...,2021,192270,$56.62,$59.31,$67.26
13,13,Management Occupations - Operations Specialtie...,2021,69310,$64.71,$59.31,$67.26
14,14,Management Occupations - Operations Specialtie...,2021,144640,$50.76,$59.31,$67.26

### Task 3

Drop any redundant or otherwise unnecessary columns from `df_wages`. Make a note of why these columns are suitable for dropping!

In [41]:
# Drop columns not useful for analysis
df_wages = df_wages.drop(columns=['Footnote', 'OES Code', 'Unnamed: 0'], errors='ignore')

# Show remaining columns
print(df_wages.columns)

Index(['Index', 'Occupation title', 'Year', 'Employment',
       'Average hourly wage', 'Industry average',
       'Similar occupation average'],
      dtype='object')

### Task 4

Display column information including names, # non-null entries, and data types.

In [42]:
df_wages.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 824 entries, 0 to 823
Data columns (total 7 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Index                       824 non-null    int64
 1   Occupation title            824 non-null    object
 2   Year                        824 non-null    int64
 3   Employment                  824 non-null    int64
 4   Average hourly wage         764 non-null    object
 5   Industry average            824 non-null    object
 6   Similar occupation average  765 non-null    object
dtypes: int64(3), object(4)
memory usage: 45.2+ KB

## Task Group 2 - Column Transformations

### Task 5

Use pandas to split the information in the `Occupation title` column into new columns `Industry`, `Level`, and `Occupation`.

In [43]:
# Example split assuming the delimiter is " - "
split_cols = df_wages['Occupation title'].str.split(' - ', expand=True)

# Rename the new columns
split_cols.columns = ['Industry', 'Level', 'Occupation']

# Combine the new columns back into the original DataFrame
df_wages = pd.concat([df_wages, split_cols], axis=1)

# Optional: drop the original column if it's no longer needed
# df_wages.drop(columns=['Occupation title'], inplace=True)

# Show the updated DataFrame
df_wages[['Occupation title', 'Industry', 'Level', 'Occupation']].head(10)

,Occupation title,Industry,Level,Occupation
0,Management Occupations - Top Executives - Chie...,Management Occupations,Top Executives,Chief Executives
1,Management Occupations - Top Executives - Gene...,Management Occupations,Top Executives,General and Operations Managers
2,Management Occupations - Top Executives - Legi...,Management Occupations,Top Executives,Legislators
3,"Management Occupations - Advertising, Marketin...",Management Occupations,"Advertising, Marketing, Promotions, Public Rel...",Advertising and Promotions Managers
4,"Management Occupations - Advertising, Marketin...",Management Occupations,"Advertising, Marketing, Promotions, Public Rel...",Marketing Managers
5,"Management Occupations - Advertising, Marketin...",Management Occupations,"Advertising, Marketing, Promotions, Public Rel...",Sales Managers
6,"Management Occupations - Advertising, Marketin...",Management Occupations,"Advertising, Marketing, Promotions, Public Rel...",Public Relations Managers
7,"Management Occupations - Advertising, Marketin...",Management Occupations,"Advertising, Marketing, Promotions, Public Rel...",Fundraising Managers
8,Management Occupations - Operations Specialtie...,Management Occupations,Operations Specialties Managers,Administrative Services Managers
9,Management Occupations - Operations Specialtie...,Management Occupations,Operations Specialties Managers,Facilities Managers

### Task 6

Remove any leading and trailing whitespaces in the columns `Industry`, `Level`, and `Occupation`.

In [44]:

# Split the 'Occupation title' into 3 parts: Industry, Level, Occupation
split_cols = df_wages['Occupation title'].str.split('–', n=2, expand=True)

# Assign the split columns, naming them
df_wages['Industry'] = split_cols[0].str.strip()
df_wages['Level'] = split_cols[1].str.strip() if 1 in split_cols.columns else None
df_wages['Occupation'] = split_cols[2].str.strip() if 2 in split_cols.columns else None

# Display the result
df_wages[['Occupation title', 'Industry', 'Level', 'Occupation']].head(10)

,Occupation title,Industry,Level,Occupation
0,Management Occupations - Top Executives - Chie...,Management Occupations - Top Executives - Chie...,None,None
1,Management Occupations - Top Executives - Gene...,Management Occupations - Top Executives - Gene...,None,None
2,Management Occupations - Top Executives - Legi...,Management Occupations - Top Executives - Legi...,None,None
3,"Management Occupations - Advertising, Marketin...","Management Occupations - Advertising, Marketin...",None,None
4,"Management Occupations - Advertising, Marketin...","Management Occupations - Advertising, Marketin...",None,None
5,"Management Occupations - Advertising, Marketin...","Management Occupations - Advertising, Marketin...",None,None
6,"Management Occupations - Advertising, Marketin...","Management Occupations - Advertising, Marketin...",None,None
7,"Management Occupations - Advertising, Marketin...","Management Occupations - Advertising, Marketin...",None,None
8,Management Occupations - Operations Specialtie...,Management Occupations - Operations Specialtie...,None,None
9,Management Occupations - Operations Specialtie...,Management Occupations - Operations Specialtie...,None,None

### Task 7

Replace the `'$'` character in the columns `Average hourly wage`, `Industry average`, and `Similar occupation average` with an empty character `''` (no space between the single quotes!).

In [45]:

# Remove '$' from the specified columns
df_wages['Average hourly wage'] = df_wages['Average hourly wage'].str.replace('$', '', regex=False)
df_wages['Industry average'] = df_wages['Industry average'].str.replace('$', '', regex=False)
df_wages['Similar occupation average'] = df_wages['Similar occupation average'].str.replace('$', '', regex=False)

# Show the cleaned columns
df_wages[['Average hourly wage', 'Industry average', 'Similar occupation average']].head()

  Average hourly wage Industry average Similar occupation average
0              102.41            59.31                      57.94
1               55.41            59.31                      57.94
2                 NaN            59.31                      57.94
3               68.68            59.31                      69.77
4               73.77            59.31                      69.77

### Task 8

Convert the data types of the columns `Average hourly wage`, `Industry average`, and `Similar occupation average` from `object` to `float`.

In [46]:
df_wages.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 824 entries, 0 to 823
Data columns (total 10 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Index                       824 non-null    int64
 1   Occupation title            824 non-null    object
 2   Year                        824 non-null    int64
 3   Employment                  824 non-null    int64
 4   Average hourly wage         764 non-null    object
 5   Industry average            824 non-null    object
 6   Similar occupation average  765 non-null    object
 7   Industry                    824 non-null    object
 8   Level                       0 non-null      object
 9   Occupation                  0 non-null      object
dtypes: int64(3), object(7)
memory usage: 64.5+ KB

In [47]:

## Average hourly wage is object 
## Industry average is object 
## Similar occupation average is object

# Convert columns to float
df_wages['Average hourly wage'] = pd.to_numeric(df_wages['Average hourly wage'])
df_wages['Industry average'] = pd.to_numeric(df_wages['Industry average'])
df_wages['Similar occupation average'] = pd.to_numeric(df_wages['Similar occupation average'])

# Check the updated data types
print(df_wages.dtypes[['Average hourly wage', 'Industry average', 'Similar occupation average']])

Average hourly wage           float64
Industry average              float64
Similar occupation average    float64
dtype: object

In [48]:
df_wages.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 824 entries, 0 to 823
Data columns (total 10 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Index                       824 non-null    int64
 1   Occupation title            824 non-null    object
 2   Year                        824 non-null    int64
 3   Employment                  824 non-null    int64
 4   Average hourly wage         764 non-null    float64
 5   Industry average            824 non-null    float64
 6   Similar occupation average  765 non-null    float64
 7   Industry                    824 non-null    object
 8   Level                       0 non-null      object
 9   Occupation                  0 non-null      object
dtypes: float64(3), int64(3), object(4)
memory usage: 64.5+ KB

## Task Group 3 - Comparison to Industry Average

### Task 9

Calculate the difference between the average hourly wage and the industry average. Assign the difference to a new column `Industry wage difference`.

In [49]:

# Calculate the difference between Average hourly wage and Industry average
df_wages['Industry wage difference'] = df_wages['Average hourly wage'] - df_wages['Industry average']

# Show output
print(df_wages[['Occupation', 'Average hourly wage', 'Industry average', 'Industry wage difference']].head())

  Occupation  Average hourly wage  Industry average  Industry wage difference
0       None               102.41             59.31                     43.10
1       None                55.41             59.31                     -3.90
2       None                  NaN             59.31                       NaN
3       None                68.68             59.31                      9.37
4       None                73.77             59.31                     14.46

### Task 10

Divide `Industry wage difference` by `Industry average` to convert the difference to a percent change. (You might want to multiply by `100` at the end to display as a percentage).

Assign the result to new column called `Industry wage pctchg`.

In [50]:

# Calculate the percentage change between the Average hourly wage and the Industry average
df_wages['Industry wage pctchg'] = (df_wages['Industry wage difference'] / df_wages['Industry average']) * 100

# Show output
print(df_wages[['Industry', 'Occupation', 'Level', 'Average hourly wage', 'Industry average', 'Industry wage pctchg']].head())

                                            Industry Occupation Level  \
0  Management Occupations - Top Executives - Chie...       None  None
1  Management Occupations - Top Executives - Gene...       None  None
2  Management Occupations - Top Executives - Legi...       None  None
3  Management Occupations - Advertising, Marketin...       None  None
4  Management Occupations - Advertising, Marketin...       None  None

   Average hourly wage  Industry average  Industry wage pctchg
0               102.41             59.31             72.669027
1                55.41             59.31             -6.575620
2                  NaN             59.31                   NaN
3                68.68             59.31             15.798348
4                73.77             59.31             24.380374

### Task 11

Sort `df_wages` by the `Industry wage pctchg` column from *highest* to *lowest*. Assign the result to the variable `highest_industry_pctchg`.

In [51]:
# Sort the DataFrame by the 'Industry wage pctchg' column from highest to lowest
highest_industry_pctchg = df_wages.sort_values(by='Industry wage pctchg', ascending=False)

# Show output
print(highest_industry_pctchg[['Industry', 'Occupation', 'Level', 'Average hourly wage', 'Industry average', 'Industry wage pctchg']].head())

                                              Industry Occupation Level  \
329  Healthcare Practitioners and Technical Occupat...       None  None
460  Personal Care and Service Occupations - Person...       None  None
328  Healthcare Practitioners and Technical Occupat...       None  None
305  Healthcare Practitioners and Technical Occupat...       None  None
331  Healthcare Practitioners and Technical Occupat...       None  None

     Average hourly wage  Industry average  Industry wage pctchg
329               170.18             43.80            288.538813
460                59.80             16.17            269.820656
328               159.22             43.80            263.515982
305               149.74             43.80            241.872146
331               149.35             43.80            240.981735

## Task Group 4 - Computer Jobs

### Task 12

Use the separate `Industry` column you created in Task 5 to investigate occupations in the **'Computer and Mathematical Occupations'** industry. Filter `df_wages` for this specific industry and create a new DataFrame named `cs_math_occupations`.

In [54]:
# Filter df_wages for the 'Computer and Mathematical Occupations' industry
cs_math_occupations = df_wages[df_wages['Industry'] == 'Computer and Mathematical Occupations']

# Show output
cs_math_occupations.head()

Empty DataFrame
Columns: [Index, Occupation title, Year, Employment, Average hourly wage, Industry average, Similar occupation average, Industry, Level, Occupation, Industry wage difference, Industry wage pctchg]
Index: []

### Task 13

Sort `cs_math_occupations` by `Average hourly wage` from highest to lowest, and display the results.

In [55]:
# Sort by Average hourly wage from highest to lowest
cs_math_occupations_sorted = cs_math_occupations.sort_values(by='Average hourly wage', ascending=False)

# Display the sorted DataFrame
print(cs_math_occupations_sorted[['Industry', 'Occupation', 'Level', 'Average hourly wage', 'Industry average', 'Industry wage pctchg']])

Empty DataFrame
Columns: [Industry, Occupation, Level, Average hourly wage, Industry average, Industry wage pctchg]
Index: []